Revit 2026 API

# StructuralConnectionApprovalTypeGetAllStructuralConnectionApprovalTypes Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void GetAllStructuralConnectionApprovalTypes(
	Document cda,
	out ICollection<ElementId> ids
)
```
```vb
Public Shared Sub GetAllStructuralConnectionApprovalTypes (
	cda As Document,
	<OutAttribute> ByRef ids As ICollection(Of ElementId)
)
```
```cpp
public:
static void GetAllStructuralConnectionApprovalTypes(
	Document^ cda,
	[OutAttribute] ICollection<ElementId^>^% ids
)
```
```fsharp
static member GetAllStructuralConnectionApprovalTypes :
        cda : Document *
        ids : ICollection<ElementId> byref -> unit
```

#### Parameters

cda Document

ids ICollectionElementId

#### Reference

StructuralConnectionApprovalType Class

Autodesk.Revit.DB.Structure Namespace